tutorials4HD/porousHemodynamic4HD/internalCarotidArtery/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions		[0 0 0 1 0 0 0];

internalField		uniform 310.0;
boundaryField
{
    consoleFluid
    {
	type		fixedValue;
	value		uniform 311.0;
    }

    inletFluid
    {
	type		fixedValue;
	value		$internalField;
    }

    outlet1Fluid
    {
	type		zeroGradient;
    }

    outlet2Fluid
    {
	type		zeroGradient;
    }

    outlet3Fluid
    {
	type		zeroGradient;
    }
}
// ************************************************************************* //
